# В большой текстовой строке подсчитать количество встречаемых слов и вернуть 10 самых частых. Не учитывать знаки препинания и регистр символов. 
# За основу возьмите любую статью из википедии или из документации к языку.

text = '''Основатели рода Буэндиа Хосе Аркадио и Урсула были двоюродными братом и сестрой. Родичи боялись, что они родят ребёнка с поросячьим хвостиком. 
Об опасности инцестуального брака знает Урсула, а Хосе Аркадио не желает принимать во внимание подобные глупости. На протяжении полутора лет замужества 
Урсула умудряется сохранить невинность, ночи молодожёнов заполнены томительной и жестокой борьбой, заменяющей любовные утехи. Во время петушиных боев петух 
Хосе Аркадио одерживает победу над петухом Пруденсио Агиляра, и тот, раздосадованный, издевается над соперником, ставя под сомнение его мужские достоинства, 
поскольку Урсула до сих пор ещё девственница. Возмущённый Хосе Аркадио отправляется домой за копьём и убивает Пруденсио, а затем, потрясая тем же копьём, заставляет 
Урсулу выполнить свои супружеские обязанности. Но отныне нет им покоя от окровавленного призрака Агиляра. Решив перебраться на новое местожительство, Хосе Аркадио, 
словно принося жертву, убивает всех своих петухов, зарывает во дворе копье и покидает деревню вместе с женой и сельчанами. Двадцать два храбреца одолевают в поисках 
моря неприступный горный хребет и после двух лет бесплодных скитаний основывают на берегу реки селение Макондо на то Хосе Аркадио было во сне вещее указание. 
И вот на большой поляне вырастают два десятка хижин из глины и бамбука.
Хосе Аркадио сжигает страсть к познанию мира  больше всего на свете его привлекают разные чудесные вещи, которые доставляют в селение появляющиеся раз в году цыгане: 
бруски магнита, лупа, навигационные приборы; от их вожака Мелькиадеса он узнает и секреты алхимии, изводит себя долгими бдениями и лихорадочной работой воспалённого воображения.
 Потеряв интерес к очередной сумасбродной затее, он возвращается к размеренной трудовой жизни, вместе с соседями обустраивает посёлок, размежёвывает земли, прокладывает дороги. 
 Жизнь в Макондо патриархальная, добропорядочная, счастливая, здесь даже нет кладбища, поскольку никто не умирает. Урсула затевает прибыльное производство зверушек и птиц из
 леденцов. Но с появлением в доме Буэндиа неведомо откуда пришедшей Ребеки, которая становится им приёмной дочерью, начинается в Макондо эпидемия бессонницы. Жители селения 
 прилежно переделывают все свои дела и начинают маяться тягостным бездельем. А потом обрушивается на Макондо другая напасть  эпидемия забывчивости. Все живут в постоянно 
 ускользающей от них действительности, забывая названия предметов. Они решают вешать на них таблички, но опасаются того, что по истечении времени не в силах будут вспомнить
 азначение предметов.
Хосе Аркадио намеревается было построить машину памяти, но выручает скиталец-цыган, учёный-волшебник Мелькиадес с его целительным снадобьем. По его пророчеству Макондо исчезнет 
с лица земли, а на его месте вырастет сверкающий город с большими домами из прозрачного стекла, но не останется в нем и следов от рода Буэндиа. Хосе Аркадио не желает этому 
верить: Буэндиа будут всегда. Мелькиадес знакомит Хосе Аркадио ещё с одним чудесным изобретением, которому суждено сыграть роковую роль в его судьбе. Самая дерзостная затея 
Хосе Аркадио  с помощью дагеротипии запечатлеть бога, чтобы научно доказать существование всевышнего или опровергнуть это. В конце концов Буэндиа сходит с ума и кончает свои 
дни прикованным к большому каштану во дворе своего дома.
В первенце Хосе Аркадио, названном так же, как и отец, воплотилась его агрессивная сексуальность. Он растрачивает годы своей жизни на бесчисленные похождения. 
Второй сын Аурелиано, рассеянный и вялый, осваивает ювелирное дело. Тем временем селение разрастается, превращаясь в провинциальный городок, обзаводится коррехидором, 
священником, заведением Катарино  первой брешью в стене добронравия макондовцев. Воображение Аурелиано потрясает красота дочки коррехидора Ремедиос. А Ребека и другая дочь 
Урсулы Амаранта влюбляются в итальянца, мастера по пианолам Пьетро Креспи. Происходят бурные ссоры, кипит ревность, но в итоге Ребека отдаёт предпочтение сверхсамцу
Хосе Аркадио, которого, по иронии судьбы, настигают тихая семейная жизнь под каблуком жены и пуля, выпущенная неизвестно кем, скорее всего той же женой. Ребека решается на 
затворничество, заживо хороня себя в доме. Из трусости, эгоизма и страха Амаранта так и отказывается от любви, на склоне лет она принимается ткать себе саван и угасает, 
закончив его. Когда Ремедиос умирает от родов, Аурелиано, угнетённый обманутыми надеждами, пребывает в пассивном, тоскливом состоянии. Однако циничные махинации тестя-коррехидора 
с избирательными бюллетенями во время выборов да самоуправство военных в родном городке вынуждают его уйти воевать на стороне либералов, хотя политика и кажется ему чем-то 
абстрактным. Война выковывает его характер, но опустошает душу, поскольку, в сущности, борьба за национальные интересы давно уже превратилась в борьбу за власть.'''

import re
my_list = re.sub(r'[^\w\s]', '',text.upper()).split()

result = {}
for word in my_list:
    if word in result:
        result[word] += 1
    else:
        result[word] = 1

result_1 = sorted(result.items(), key=lambda x: x[1], reverse=True)[:10]
print(result_1)


